
# 논리 : 맞는지 틀린지 판단
# 연산자 :
    # 산술연산자 : +더하기 -빼기 *곱하기 /나누기 //나누기[몫] %나누기[나머지]
    # 비교연산자 : >초과 <미만 >=이상 <=이하 ==같다 !=같지않다
    # 논리연산자 : and[이면서] or[아니면] ![부정]
    # 대입연산자 : =[오른쪽 값을 왼쪽에 대입]
                # +=[오른쪽값을 왼쪽값에 더하기 후 왼쪽값에 대입]
                # -=[오른쪽값을 왼쪽값에 뺴기 후 왼쪽값에 대입]
                # *= /= %= 등

# IF : 논리문
# if논리 :
    # 참[코드]
# else :
    # 거짓[코드]

# if 논리 :
#   참[코드]
# elif 논리2 :
#   참2[코드2]
# else :
#   참3[코드3]

# if 논리 :
#   if 논리 :
#       참[코드]
#   else :
#       거짓[코드]
# else :
#   if 논리 :
#

# 101
# bool

# 102
# False

# 103
# True

# 104
# True

# 105
# True

# 106
# '=>'가 아니라 '>='이다

# 107
# 아무것도 출력되지 않음

# 108
# Hi, there.

# 109
# 1
# 2
# 4

# 110
# 3
# 5