
# 141
리스트 = [100,200,300]
for 변수 in 리스트 :
    print(변수+10)

# 142
리스트 = ["김밥","라면","튀김"]
for 변수 in 리스트 :
    print("오늘의 메뉴:",변수)

# 143
리스트 = ["SK하이닉스","삼성전자","LG전자"]
for 변수 in 리스트 :
    print(len(변수))

# 144
리스트 = ["dog","cat","parrot"]
for 변수 in 리스트 :
    print(변수,len(변수))

# 145
리스트 = ["dog","cat","parrot"]
for 변수 in 리스트 :
    print(변수[0])

# 146
리스트 = [1,2,3]
for 변수 in 리스트 :
    print("3 x",변수)

# 147
리스트 = [1,2,3]
for 변수 in 리스트 :
    print("3 x",변수, "=" ,변수*3)

# 148
리스트 = ["가","나","다","라"]
리스트2 = 리스트[1:4]
for 변수 in 리스트2 :
    print(변수)

# 149
리스트 = ["가","나","다","라"]
리스트2 = 리스트[0:4:2]
for 변수 in 리스트2 :
    print(변수)


# 150
리스트 = ["가","나","다","라"]
리스트2 = 리스트[::-1]
for 변수 in 리스트2 :
    print(변수)