
# 1. print() 함수
    # 모니터 화면에 결과물을 출력하는 함수
    # 괄호 안에 문자열 혹은 값을 작성하면 출력됨

# 2. type() , int() , str() , float() 함수
    # type() : 괄호 안의 값의 타입을 반환하는 함수
        # 괄호안에 값을 작성하면 타입( int str float )이 '<class 'int/str/float'> 형태로 반환됨
    # int() : 정수변환함수
        # 괄호 안에 작성한 값을 정수로 변환시킴
    # str() : 문자변환함수
        # 괄호 안에 작성한 값을 문자로 변환시킴
    # float() : 실수변환함수
        # 괄호 안에 작성한 값을 실수로 변환시킴

# 3. 인덱싱이란
    # 인덱싱 : 문장쳘에서 어떤 글자나 특정 위치를 가리키는 것

# 4.슬라이싱
    # 슬라이싱 : 특정 문자열에서 무엇인가를 잘라내는 것

# 5. replace() 함수
    # 문자열을 변경할 수 있는 함수
    # replace("a","b") 형태로 사용하면 문자열의 a를 b로 변환함